apache/nuttx/arch/arm/src/common/stm32/stm32_fdcan_m3m4_v1_sock.c
  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  ninfo("FDCAN%d\n", config->port);

  /* Disable FDCAN interrupts at the NVIC */

  up_disable_irq(config->irq0);
  up_disable_irq(config->irq1);

  /* Disable all interrupts from the FDCAN peripheral */

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, 0);
  fdcan_putreg(priv, STM32_FDCAN_TXBTIE_OFFSET, 0);

  /* Detach the FDCAN interrupt handler */

  irq_detach(config->irq0);
  irq_detach(config->irq1);

  /* Disable device by setting the Clock Stop Request bit */

  regval = fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET);
  regval |= FDCAN_CCCR_CSR;
  fdcan_putreg(priv, STM32_FDCAN_CCCR_OFFSET, regval);

  /* Wait for Init and Clock Stop Acknowledge bits to verify
   * device is in the powered down state
   */

  while ((fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET) & FDCAN_CCCR_INIT)
         == 0);
  while ((fdcan_getreg(priv, STM32_FDCAN_CCCR_OFFSET) & FDCAN_CCCR_CSA)
         == 0);
  priv->state = FDCAN_STATE_DISABLED;
}

/****************************************************************************
 * Name: fdcan_rx0int
 *
 * Description:
 *   Call to enable or disable RX0 interrupts.
 *
 * Input Parameters:
 *   priv - reference to the private CAN driver state structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_rx0int(struct stm32_fdcan_s *priv, bool enable)
{
  const struct stm32_config_s *config = NULL;
  uint32_t regval = 0;

  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  ninfo("CAN%" PRIu8 "RX0 enable: %d\n", config->port, enable);

  /* Enable/disable the FIFO 0 message pending interrupt */

  regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

  if (enable)
    {
      regval |= FDCAN_RXFIFO0_INTS;
    }
  else
    {
      regval &= ~FDCAN_RXFIFO0_INTS;
    }

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
}

/****************************************************************************
 * Name: fdcan_rx1int
 *
 * Description:
 *   Call to enable or disable RX1 interrupts.
 *
 * Input Parameters:
 *   priv - reference to the private CAN driver state structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_rx1int(struct stm32_fdcan_s *priv, bool enable)
{
  const struct stm32_config_s *config = NULL;
  uint32_t regval = 0;

  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  ninfo("CAN%" PRIu8 "RX1 enable: %d\n", config->port, enable);

  /* Enable/disable the FIFO 1 message pending interrupt */

  regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

  if (enable)
    {
      regval |= FDCAN_RXFIFO1_INTS;
    }
  else
    {
      regval &= ~FDCAN_RXFIFO1_INTS;
    }

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
}

/****************************************************************************
 * Name: fdcan_txint
 *
 * Description:
 *   Call to enable or disable TX interrupts.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_txint(struct stm32_fdcan_s *priv, bool enable)
{
  const struct stm32_config_s *config = NULL;
  uint32_t regval = 0;

  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  ninfo("CAN%" PRIu8 "TX enable: %d\n", config->port, enable);

  /* Enable/disable the receive interrupts */

  regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

  if (enable)
    {
      regval |= FDCAN_TXFIFOQ_INTS;
    }
  else
    {
      regval &= ~FDCAN_TXFIFOQ_INTS;
    }

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
}

#ifdef CONFIG_NET_CAN_ERRORS
/****************************************************************************
 * Name: fdcan_txint
 *
 * Description:
 *   Call to enable or disable CAN SCE interrupts.
 *
 * Input Parameters:
 *   priv - reference to the private CAN driver state structure
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_errint(struct stm32_fdcan_s *priv, bool enable)
{
  const struct stm32_config_s *config = NULL;
  uint32_t regval = 0;

  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  ninfo("CAN%" PRIu8 "ERR enable: %d\n", config->port, enable);

  /* Enable/disable the transmit mailbox interrupt */

  regval  = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);
  if (enable)
    {
      regval |= FDCAN_ANYERR_INTS;
    }
  else
    {
      regval &= ~FDCAN_ANYERR_INTS;
    }

  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
}
#endif

/****************************************************************************
 * Name: fdcan_send
 *
 * Description:
 *    Send one can message.
 *
 *    One CAN-message consists of a maximum of 10 bytes.  A message is
 *    composed of at least the first 2 bytes (when there are no data bytes).
 *
 *    Byte 0:      Bits 0-7: Bits 3-10 of the 11-bit CAN identifier
 *    Byte 1:      Bits 5-7: Bits 0-2 of the 11-bit CAN identifier
 *                 Bit 4:    Remote Transmission Request (RTR)
 *                 Bits 0-3: Data Length Code (DLC)
 *    Bytes 2-10: CAN data
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int fdcan_send(struct stm32_fdcan_s *priv)
{
  const struct stm32_config_s *config     = NULL;
  volatile uint32_t           *txbuffer   = NULL;
  const uint8_t               *src        = NULL;
  uint32_t                    *dest       = NULL;
  uint32_t                     regval     = 0;
  unsigned int                 ndx        = 0;
  unsigned int                 nbytes     = 0;
  uint32_t                     wordbuffer = 0;
  unsigned int                 i          = 0;

