apache/nuttx/arch/arm/src/common/stm32/stm32_fdcan_m3m4_v1_sock.c
#ifdef CONFIG_NET_CAN_ERRORS
          /* Turning back on all configured RX error interrupts */

          regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);
          regval |= FDCAN_RXERR_INTS;
          fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
#endif
        }

      /* Acknowledge reading the FIFO entry */

      fdcan_putreg(priv, STM32_FDCAN_RXF0A_OFFSET, ndx);
    }

  /* Re-enable CAN RX interrupts */

  fdcan_rx0int(priv, true);
}

/****************************************************************************
 * Name: fdcan_rx1interrupt_work
 *
 * Description:
 *   CAN RX FIFO 1 worker
 *
 ****************************************************************************/

static void fdcan_rx1interrupt_work(void *arg)
{
  struct stm32_fdcan_s        *priv   = (struct stm32_fdcan_s *)arg;
  const struct stm32_config_s *config = NULL;
  uint32_t                     regval = 0;
  unsigned int                 nelem  = 0;
  unsigned int                 ndx    = 0;

  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  /* Clear the RX FIFO1 new message interrupt */

  fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_INT_RF1N);

  /* Check if there is anything in RX FIFO1 */

  regval = fdcan_getreg(priv, STM32_FDCAN_RXF1S_OFFSET);
  nelem  = (regval & FDCAN_RXFS_FFL_MASK) >> FDCAN_RXFS_FFL_SHIFT;
  if (nelem == 0)
    {
      /* Clear the RX FIFO1 interrupt (and all other FIFO1-related
       * interrupts)
       */

      /* Handle the newly received message in FIFO1 */

      ndx = (regval & FDCAN_RXFS_FGI_MASK) >> FDCAN_RXFS_FGI_SHIFT;

      if ((regval & FDCAN_RXFS_RFL) != 0)
        {
          nerr("ERROR: Message lost: %08" PRIx32 "\n", regval);
        }
      else
        {
          fdcan_receive(priv,
                        config->msgram.rxfifo1 +
                        (ndx * priv->config->rxfifo1esize),
                        priv->config->rxfifo1esize);

#ifdef CONFIG_NET_CAN_ERRORS
          /* Turning back on all configured RX error interrupts */

          regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);
          regval |= FDCAN_RXERR_INTS;
          fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
#endif
        }

      /* Acknowledge reading the FIFO entry */

      fdcan_putreg(priv, STM32_FDCAN_RXF1A_OFFSET, ndx);
    }

  /* Re-enable CAN RX interrupts */

  fdcan_rx1int(priv, true);
}

/****************************************************************************
 * Name: fdcan_txdone_work
 ****************************************************************************/

static void fdcan_txdone_work(void *arg)
{
  struct stm32_fdcan_s *priv = (struct stm32_fdcan_s *)arg;

  fdcan_txdone(priv);

  /* There should be space for a new TX in any event.  Poll the network for
   * new XMIT data
   */

  net_lock();
  devif_poll(&priv->dev, fdcan_txpoll);
  net_unlock();
}

/****************************************************************************
 * Name: fdcan_txdone
 ****************************************************************************/

static void fdcan_txdone(struct stm32_fdcan_s *priv)
{
  const struct stm32_config_s *config = NULL;
  unsigned int                 ndx    = 0;
  uint32_t                     regval = 0;

  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  /* Clear the pending TX completion interrupt (and all
   * other TX-related interrupts)
   */

  fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_TXFIFOQ_INTS);

  /* Check all TX buffers */

  regval = fdcan_getreg(priv, STM32_FDCAN_TXBTO_OFFSET);
  for (ndx = 0; ndx < config->ntxfifoq; ndx++)
    {
      if ((regval & (1 << ndx)) != 0)
        {
          /* Tell the upper half that the transfer is finished. */

          NETDEV_TXDONE(&priv->dev);
        }
    }

#ifdef CONFIG_NET_CAN_ERRORS
  /* Turning back on PEA and PED error interrupts */

  regval = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);
  regval |= (FDCAN_INT_PEA | FDCAN_INT_PED);
  fdcan_putreg(priv, STM32_FDCAN_IE_OFFSET, regval);
#endif

  /* Re-enable TX interrupts */

  fdcan_txint(priv, true);
}

#ifdef CONFIG_NET_CAN_ERRORS
/****************************************************************************
 * Name: fdcan_error_work
 ****************************************************************************/

static void fdcan_error_work(void *arg)
{
  struct stm32_fdcan_s *priv    = (struct stm32_fdcan_s *)arg;
  uint32_t              pending = 0;
  uint32_t              ir      = 0;
  uint32_t              ie      = 0;
  uint32_t              psr     = 0;

  /* Get the set of pending interrupts. */

  ir = fdcan_getreg(priv, STM32_FDCAN_IR_OFFSET);
  ie = fdcan_getreg(priv, STM32_FDCAN_IE_OFFSET);

  pending = (ir & ie);
  ie |= FDCAN_ANYERR_INTS;

  /* Check for common errors */

  if ((pending & FDCAN_CMNERR_INTS) != 0)
    {
      /* When a protocol error occurs, the problem is recorded in
       * the LEC/DLEC fields of the PSR register. In lieu of
       * separate interrupt flags for each error, the hardware
       * groups protocol errors under a single interrupt each for
       * arbitration and data phases.
       *
       * These errors have a tendency to flood the system with
       * interrupts, so they are disabled here until we get a
       * successful transfer/receive on the hardware
       */

      psr = fdcan_getreg(priv, STM32_FDCAN_PSR_OFFSET);

      if ((psr & FDCAN_PSR_LEC_MASK) != 0)
        {
          ie &= ~(FDCAN_INT_PEA | FDCAN_INT_PED);
        }

      /* Clear the error indications */

      fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_CMNERR_INTS);
    }

  /* Check for transmission errors */

  if ((pending & FDCAN_TXERR_INTS) != 0)
    {
      /* An Acknowledge-Error will occur if for example the device
       * is not connected to the bus.
       *
       * The CAN-Standard states that the Chip has to retry the
       * message forever, which will produce an ACKE every time.
       * To prevent this Interrupt-Flooding and the high CPU-Load
       * we disable the ACKE here as long we didn't transfer at
       * least one message successfully (see FDCAN_INT_TC below).
       */

      /* Clear the error indications */

      fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_TXERR_INTS);
    }

  /* Check for reception errors */

  if ((pending & FDCAN_RXERR_INTS) != 0)
    {
      /* To prevent Interrupt-Flooding the current active
       * RX error interrupts are disabled. After successfully
       * receiving at least one CAN packet all RX error interrupts
       * are turned back on.
       *
       * The Interrupt-Flooding can for example occur if the
       * configured CAN speed does not match the speed of the other
       * CAN nodes in the network.
       */

