apache/nuttx/arch/arm/src/common/stm32/stm32_fdcan_m3m4_v1_sock.c
      frame->can_id  = errbits;
      frame->can_dlc = CAN_ERR_DLC;

      memcpy(frame->data, data, CAN_ERR_DLC);

      /* Copy the buffer pointer to priv->dev..  Set amount of data
       * in priv->dev.d_len
       */

      priv->dev.d_len = sizeof(struct can_frame);
      priv->dev.d_buf = (uint8_t *)frame;

      /* Send to socket interface */

      NETDEV_ERRORS(&priv->dev);

      can_input(&priv->dev);

      /* Point the packet buffer back to the next Tx buffer that will be
       * used during the next write.  If the write queue is full, then
       * this will point at an active buffer, which must not be written
       * to.  This is OK because devif_poll won't be called unless the
       * queue is not full.
       */

      priv->dev.d_buf = (uint8_t *)priv->txdesc;
    }
}
#endif /* CONFIG_NET_CAN_ERRORS */

/****************************************************************************
 * Name: fdcan_receive
 *
 * Description:
 *   Receive an FDCAN messages
 *
 * Input Parameters:
 *   dev      - CAN-common state data
 *   rxbuffer - The RX buffer containing the received messages
 *   nwords   - The length of the RX buffer (element size in words).
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_receive(struct stm32_fdcan_s *priv,
                          volatile uint32_t *rxbuffer,
                          unsigned long nwords)
{
  fdcan_dumprxregs(dev->cd_priv, "Before receive");

  /* CAN 2.0 or CAN FD */

#ifdef CONFIG_NET_CAN_CANFD
  if ((rxbuffer[1] & BUFFER_R1_FDF) != 0)
    {
      struct canfd_frame *frame = (struct canfd_frame *)priv->rxdesc;

      /* Format the CAN FD header */

      /* Extract the RTR bit */

      if ((rxbuffer[0] & BUFFER_R0_RTR) != 0)
        {
          frame->can_id |= CAN_RTR_FLAG;
        }

#ifdef CONFIG_NET_CAN_EXTID
      if ((rxbuffer[0] & BUFFER_R0_XTD) != 0)
        {
          /* Save the extended ID of the newly received message */

          frame->can_id = ((rxbuffer[0] & BUFFER_R0_EXTID_MASK) >>
                           BUFFER_R0_EXTID_SHIFT);
          frame->can_id |= CAN_EFF_FLAG;
        }
      else
        {
          frame->can_id = ((rxbuffer[0] & BUFFER_R0_STDID_MASK) >>
                           BUFFER_R0_STDID_SHIFT);
          frame->can_id &= ~CAN_EFF_FLAG;
        }
#else
      if ((rxbuffer[0] & BUFFER_R0_XTD) != 0)
        {
          /* Drop any messages with extended IDs */

          return;
        }

      /* Save the standard ID of the newly received message */

      frame->can_id = ((rxbuffer[0] & BUFFER_R0_STDID_MASK) >>
                       BUFFER_R0_STDID_SHIFT);
#endif

      /* Word R1 contains the DLC and timestamp */

      frame->len = g_can_dlc_to_len[((rxbuffer[1] & BUFFER_R1_DLC_MASK) >>
                                    BUFFER_R1_DLC_SHIFT)];

      /* Get CANFD flags */

      frame->flags = 0;

      if ((rxbuffer[0] & BUFFER_R0_ESI) != 0)
        {
          frame->flags |= CANFD_ESI;
        }

      if ((rxbuffer[1] & BUFFER_R1_BRS) != 0)
        {
          frame->flags |= CANFD_BRS;
        }

      /* Save the message data */

      memcpy(frame->data, (void *)&rxbuffer[2], frame->len);

      /* Copy the buffer pointer to priv->dev..  Set amount of data
       * in priv->dev.d_len
       */

      priv->dev.d_len = sizeof(struct canfd_frame);
      priv->dev.d_buf = (uint8_t *)frame;
    }
  else
#endif
    {
      struct can_frame *frame  = (struct can_frame *)priv->rxdesc;

      /* Format the CAN header */

      /* Extract the RTR bit */

      if ((rxbuffer[0] & BUFFER_R0_RTR) != 0)
        {
          frame->can_id |= CAN_RTR_FLAG;
        }

#ifdef CONFIG_NET_CAN_EXTID
      if ((rxbuffer[0] & BUFFER_R0_XTD) != 0)
        {
          /* Save the extended ID of the newly received message */

          frame->can_id = ((rxbuffer[0] & BUFFER_R0_EXTID_MASK) >>
                            BUFFER_R0_EXTID_SHIFT);
          frame->can_id |= CAN_EFF_FLAG;
        }
      else
        {
          frame->can_id = ((rxbuffer[0] & BUFFER_R0_STDID_MASK) >>
                           BUFFER_R0_STDID_SHIFT);
          frame->can_id &= ~CAN_EFF_FLAG;
        }
#else
      if ((rxbuffer[0] & BUFFER_R0_XTD) != 0)
        {
          /* Drop any messages with extended IDs */

          return;
        }

      /* Save the standard ID of the newly received message */

      frame->can_id = ((rxbuffer[0] & BUFFER_R0_STDID_MASK) >>
                       BUFFER_R0_STDID_SHIFT);
#endif

      /* Word R1 contains the DLC and timestamp */

      frame->can_dlc = ((rxbuffer[1] & BUFFER_R1_DLC_MASK) >>
                        BUFFER_R1_DLC_SHIFT);

      /* Save the message data */

      memcpy(frame->data, (void *)&rxbuffer[2], frame->can_dlc);

      /* Copy the buffer pointer to priv->dev..  Set amount of data
       * in priv->dev.d_len
       */

      priv->dev.d_len = sizeof(struct can_frame);
      priv->dev.d_buf = (uint8_t *)frame;
    }

  /* Send to socket interface */

  NETDEV_RXPACKETS(&priv->dev);

  can_input(&priv->dev);

  /* Point the packet buffer back to the next Tx buffer that will be
   * used during the next write.  If the write queue is full, then
   * this will point at an active buffer, which must not be written
   * to.  This is OK because devif_poll won't be called unless the
   * queue is not full.
   */

  priv->dev.d_buf = (uint8_t *)priv->txdesc;
}

/****************************************************************************
 * Name: fdcan_interrupt
 *
 * Description:
 *   Common FDCAN interrupt handler
 *
 *   irq - The IRQ number of the interrupt.
 *   context - The register state save array at the time of the interrupt.
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int fdcan_interrupt(int irq, void *context, void *arg)
{
  struct stm32_fdcan_s *priv    = (struct stm32_fdcan_s *)arg;
  uint32_t              pending = 0;

  DEBUGASSERT(priv != NULL);

